; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image3 - mode
	thermograph4 - mode
	thermograph0 - mode
	image5 - mode
	thermograph1 - mode
	image2 - mode
	Star1 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star2 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image5)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 image3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star2)
	(supports instrument2 image2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite2 GroundStation3)
	(have_image Star6 thermograph4)
	(have_image Star6 image2)
	(have_image Phenomenon7 image2)
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 thermograph4)
	(have_image Star9 image5)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon10 image3)
	(have_image Planet11 image5)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite2 star2 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star2)
   goals met: 0 of 12
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite2 planet11 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet11)
   goals met: 0 of 12
5. (take_image satellite2 planet11 instrument4 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon7 instrument4 image2)
   added: (have_image phenomenon7 image2)
   goals met: 2 of 12
8. (turn_to satellite2 groundstation3 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation3)
   goals met: 3 of 12
9. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 12
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 12
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
12. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 3 of 12
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 3 of 12
14. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 12
15. (take_image satellite0 phenomenon8 instrument0 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 4 of 12
16. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 4 of 12
17. (take_image satellite0 planet11 instrument0 image5)
   added: (have_image planet11 image5)
   goals met: 5 of 12
18. (turn_to satellite0 star6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star6)
   goals met: 5 of 12
19. (take_image satellite0 star6 instrument0 thermograph4)
   added: (have_image star6 thermograph4)
   goals met: 6 of 12
20. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 6 of 12
21. (take_image satellite0 star9 instrument0 image5)
   added: (have_image star9 image5)
   goals met: 7 of 12
22. (take_image satellite0 star9 instrument0 thermograph4)
   added: (have_image star9 thermograph4)
   goals met: 8 of 12
23. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 9 of 12
24. (turn_to satellite1 phenomenon10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon10)
   goals met: 9 of 12
25. (take_image satellite1 phenomenon10 instrument2 image2)
   added: (have_image phenomenon10 image2)
   goals met: 10 of 12
26. (take_image satellite1 phenomenon10 instrument2 image3)
   added: (have_image phenomenon10 image3)
   goals met: 11 of 12
27. (turn_to satellite1 star6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star6)
   goals met: 11 of 12
28. (take_image satellite1 star6 instrument2 image2)
   added: (have_image star6 image2)
   goals met: 12 of 12
